#!/usr/bin/env python3

from pyecharts import Map

value = [77191.22, 72199.6, 62309.4, 43199, 39055.64, 33892.94, 30509.42, 27981.2, 26814.7, 25595.01, 25361.2, 23783.2,
         23130, 19148.5, 18319.64, 17176, 16073.56, 15256.35, 13266.1, 13239.65, 12971.85, 12688.4, 11513.44, 10292.2,
         10045.01, 6426, 3865.79, 2996.82, 2046.45, 1156.29]
attr = ['广东', '江苏', '浙江', '山东', '河南', '四川', '湖北', '湖南', '河北', '福建', '上海', '安徽', '北京', '辽宁', '陕西',
        '江西', '重庆', '天津', '内蒙古', '广西', '云南', '山西', '贵州', '黑龙江', '吉林', '甘肃', '海南', '宁夏', '青海',
        '西藏']
map_ = Map('2019年前三季度部分省份GDP总量（单位：亿元）\n注：新疆及港澳台地区暂无数据', width=1200, height=600)
map_.add('', attr, value, maptype='china',
         is_visualmap=True,
         visual_text_color='#000',
         is_label_show=True,
         visual_range=[0, 80000]
         )
map_.render('2019_GDP.html')
